src/main/test/supply-chain/3-Calculation/0-Apply Tax/3-Tax Type/0-TC02.02.03_17_Get Tax Type/15-ST_PTE_TC02.02.03_17_Get Tax Type - QST-_NetAmount/request.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
    <arg0>
<DocumentId>
    <SystemSourceId>ICI001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CustomField1</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <GrossPriceCalculation>N</GrossPriceCalculation>
  <PriceType>net</PriceType><CalculationDecimalPlaces>2</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>SER_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Domestic Services</TaxIndicatorName>
                  <TaxIndicatorComment>Domestic transaction</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>CA</SellerTaxCountry>
               <SellerTaxState>CAQC</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>SER_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>CA</BuyerTaxCountry>
               <BuyerTaxState>CAQC</BuyerTaxState>
               <CombinedTaxIndicator>SDOM</CombinedTaxIndicator>
               <CommercialIndicator>C</CommercialIndicator>
               <SellerTaxRegCountry>CA</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>CA</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <GrossPriceCountry/>

   
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
     <SellerLocalTaxCurrencyCode/>
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel>L</LegalTaxCalculationLevel>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>78100000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10</NetAmount>

      <VariableTaxSteeringInput>
        <ConsignorCountry/>
        <ConsignorState/>
        <ConsignorBusinessUnitCode/>
        <ConsignorBusinessUnitType/>
        <ConsigneeCountry/>
        <ConsigneeState/>
        <ConsigneeBusinessUnitCode/>
        <ConsigneeBusinessUnitType/>
        <CarrierCountry/>
        <CarrierState/>
        <CarrierBusinessUnitCode/>
        <CarrierBusinessUnitType/>
        <ShipmentStartCountry/>
        <ShipmentEndCountry/>
        <ShipmentStartState/>
        <ShipmentEndState/>
        <ServiceRenderedCountry/>
        <ServiceRenderedState/>
        <ResalePurpose/>
        <IsOutBonded/>
        <IsInBonded/>
        <TaxPreAlgorithmOutput>
          <IsExport/>
          <IsImport/>
          <IsExported/>
          <IsImported/>
        </TaxPreAlgorithmOutput>
        <ShippingOfCustomsClearedGoods/>
      </VariableTaxSteeringInput>       
    </TaxInvoiceLine>

  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2013-05-17</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>Y</SkipDecision>
  </TaxModuleBehaviour>
  <VariableTaxSteeringInput>
    <ConsignorCountry>CA</ConsignorCountry>
    <ConsignorState>CABC</ConsignorState>
    <ConsignorBusinessUnitCode>3133</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
   <ConsigneeCountry>CA</ConsigneeCountry>
    <ConsigneeState>CABC</ConsigneeState>
    <ConsigneeBusinessUnitCode>249</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose>Y</ResalePurpose>
    <IsOutBonded>N</IsOutBonded>
    <IsInBonded>N</IsInBonded>
    <TaxPreAlgorithmOutput>
      <IsExport>N</IsExport>
      <IsImport>N</IsImport>
      <IsExported>N</IsExported>
      <IsImported>N</IsImported>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
  <BuyerParty>
    <Party>
      <BusinessUnitCode>3101</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
         <CountryCode>CA</CountryCode>
         <StateCode>CABC</StateCode>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
	<CustomerID/>
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>3110</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode>CA</CountryCode>
         <StateCode>CABC</StateCode>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
  </SellerParty>
  <TermOfDelivery>DDU</TermOfDelivery>
  </arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>